import React from "react";
import styles from "./CurriculumCards.module.scss";
import { CinemaLabs } from "../../components/CinemaLabs";

type Subject = string;
type Courses = { [key: string]: Subject[] };
type Faculties = { [key: string]: Courses };

interface CurriculumCardsProps {
  selectedFaculty: string;
}

const faculties: Faculties = {
  "Общее образование": {
    "1 курс": [
      "Иностранный язык",
      "Зарубежная литература на иностранном языке",
      "География",
      "Кинодраматургия / История драматургии",
      "История",
      "История религий",
      "Естествознание и ОБЖ",
      "История искусств (история ИЗО и история музыки)",
      "Психология искусства и творчества",
      "Философия искусства",
    ],
    "2 курс": [
      "История кино",
      "Практическая психология",
      "Русский язык",
      "Физкультура",
      "Язык кино",
    ],
    "3 курс": ["Литература", "Математика и информатика"],
  },
  "Актёрский факультет": {
    "1 курс": [
      "Актерское мастерство",
      "Вокал",
      "Основы кинопроизводства",
      "Работа актера в кино",
      "Сценическая речь",
      "Танец",
    ],
    "2 курс": ["Работа актера над ролью", "Сцендвижение", "Педагогика"],
    "3 курс": [
      "Иностранный язык",
      "История искусств",
      "История театра",
      "Литература",
      "Практическая психология",
      "Философия",
      "Язык кино",
    ],
  },
  Кинофакультет: {
    "1 курс": [
      "Кинопроизводство*",
      "Монтаж",
      "Семинар по теории кино",
      "Кинодраматургия",
      "Основы звукорежиссуры",
      "Рисунок",
    ],
    "2 курс": [
      "Техника и технологии в современном кинопроизводстве",
      "Семинар по современному кино",
      "Продюсирование фильма",
    ],
    "3 курс": [
      "Бюджет и администрирование кинопроекта",
      "Продюсирование фильма",
    ],
    "4 курс": [
      "Курсы по индивидуальному запросу студентов под специфику диплома",
      "Фотография",
      "Работа с актером",
    ],
  },
};

const CurriculumCards: React.FC<CurriculumCardsProps> = ({
  selectedFaculty,
}) => {
  const courses = faculties[selectedFaculty] || {};

  return (
    <div className={styles["curriculum-container"]}>
      {Object.keys(courses).length > 0 ? (
        <>
          {Object.keys(courses).map((course) => (
            <div key={course} className={styles["course-content"]}>
              <h3>{course}</h3>
              <ul>
                {courses[course].map((subject, index) => (
                  <li key={index}>{subject}</li>
                ))}
              </ul>
            </div>
          ))}
          {selectedFaculty === "Кинофакультет" && <CinemaLabs />}
        </>
      ) : (
        <p>Нет данных для выбранного факультета</p>
      )}
    </div>
  );
};

export default CurriculumCards;
